emacs_config.org
#+TITLE: EMACS Config
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el
#+STARTUP: showeverything
#+AUTHOR: ATTA


* Initialization and Configuration

** User Initialization Directory Setup
#+BEGIN_SRC elisp
(defconst user-init-dir
  (cond
   ((boundp 'user-emacs-directory) user-emacs-directory)
   ((boundp 'user-init-directory) user-init-directory)
   (t "~/.emacs.d/")))

(defun load-user-file (file)
  "Load a file in current user's configuration directory."
  (interactive "f")
  (load-file (expand-file-name file user-init-dir)))
#+END_SRC

** Handling custom.el

#+BEGIN_SRC elisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+END_SRC

** Package Archives Configuration

#+BEGIN_SRC elisp
(require 'package)
(setq package-archives 
      '(("melpa" . "https://melpa.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(setq gc-cons-threshold (* 50 1000 1000))
#+END_SRC

** Use-Package Initialization

#+BEGIN_SRC elisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure 't)
#+END_SRC


* Appearance Configuration

** Font and Text Display
#+BEGIN_SRC elisp
(set-face-attribute 'default nil
                    :font "Fira Code Retina"
                    :height 170)
(setq-default fill-column 80)
(setq-default line-spacing 2)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
(global-display-fill-column-indicator-mode t)
(line-number-mode 1) 
(column-number-mode 0)
#+END_SRC 

** UI Elements Control
#+BEGIN_SRC elisp
(tooltip-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)
(blink-cursor-mode 0)
(setq use-dialog-box nil)
(set-fringe-mode 0)
(menu-bar-mode 0)
#+END_SRC 


* Startup Configuration

** Backup Settings
#+BEGIN_SRC elisp
(make-directory
 (expand-file-name "backups/" user-emacs-directory) t)

(setq backup-directory-alist `(("." . ,(expand-file-name "backups/" user-emacs-directory)))
      backup-directory-alist '(("." . "~/.emacs.d/backup"))
      backup-by-copying t    ; Don't delink hardlinks
      version-control t      ; Use version numbers on backups
      delete-old-versions t  ; Automatically delete excess backups
      kept-new-versions 20   ; how many of the newest versions to keep
      kept-old-versions 5    ; and how many of the old
      )
#+END_SRC 

** Dired Settings
#+BEGIN_SRC elisp
(setq dired-dwim-target t) 
(setq delete-by-moving-to-trash t) 
(put 'dired-find-alternate-file 'disabled nil)
(setq dired-listing-switches "-agho --group-directories-first")
#+END_SRC 

** History and State Preservation
#+BEGIN_SRC elisp
(savehist-mode 1)
(save-place-mode 1)
(setq history-length 25)
(global-auto-revert-mode 1)
#+END_SRC 

** Startup Display Settings
#+BEGIN_SRC elisp
(setq inhibit-startup-message t
      initial-major-mode 'org-mode
      initial-buffer-choice "~/Dropbox/sandbox.org")
(setq use-dialog-box nil)
#+END_SRC 

** Startup Time Display Function
#+BEGIN_SRC elisp
(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+END_SRC 

**  TRANSPARENCY

#+BEGIN_SRC   elisp   
(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter
     nil 'alpha
     (if (eql (cond ((numberp alpha) alpha)
                    ((numberp (cdr alpha)) (cdr alpha))
                    ;; Also handle undocumented (<active> <inactive>) form.
                    ((numberp (cadr alpha)) (cadr alpha))) 95)
         '(95 . 95) '(100 . 100)))))

(defun transparency (value)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha value))

(transparency 90)
#+END_SRC   

**  THEME

#+BEGIN_SRC   elisp   
(use-package beacon
  :diminish
  :config
  (beacon-mode 1)
  :custom
  (becon-push-mark 35))

(use-package nerd-icons
  :defer t)

(use-package doom-modeline 
  :init
  (doom-modeline-mode 1)
  :custom
  (doom-modeline--font-height 6))


(use-package doom-themes 
  :init
  (load-theme 'doom-palenight t))


(use-package rainbow-delimiters 
  :hook (prog-mode . rainbow-delimiters-mode))


#+END_SRC   




* Development 

** Spelling Configuration
#+BEGIN_SRC elisp
(setq ispell-dictionary "english")
#+END_SRC

** Packages Configuration

*** Sly
#+BEGIN_SRC elisp
(use-package sly)
#+END_SRC

*** No Littering
#+BEGIN_SRC elisp
(use-package no-littering
  :diminish
  :defer t)
#+END_SRC

*** General Keybindings
#+BEGIN_SRC elisp
(use-package general  
  :config
  (general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (rune/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")))
#+END_SRC

*** Evil Mode Configuration
#+BEGIN_SRC elisp
(use-package evil 
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
#+END_SRC

*** Evil Collection
#+BEGIN_SRC elisp
(use-package evil-collection 
  :after evil
  :config
  (evil-collection-init))
#+END_SRC

*** Undo Tree
#+BEGIN_SRC elisp
(use-package undo-tree
  :ensure t
  :after evil
  :diminish
  :config
  (evil-set-undo-system 'undo-tree)
  (global-undo-tree-mode 1))
#+END_SRC

*** Evil Nerd Commenter
#+BEGIN_SRC elisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+END_SRC

*** Auto Complete
#+BEGIN_SRC elisp
(use-package auto-complete
  :diminish
  :config
  (auto-complete-mode 1))
#+END_SRC

*** Parentheses Highlighting
#+BEGIN_SRC elisp
(use-package paren
  :diminish
  :config (show-paren-mode))
#+END_SRC

*** Eldoc
#+BEGIN_SRC elisp
(use-package eldoc
  :defer t
  :config (global-eldoc-mode))
#+END_SRC

*** Paredit
#+BEGIN_SRC elisp
(use-package paredit
  :demand t
  :bind
  (:map paredit-mode-map
        ("M-s" . nil))
  :config
  (add-hook 'emacs-lisp-mode-hook #'paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode))
#+END_SRC

*** Which Key
#+BEGIN_SRC elisp
(use-package which-key
  :init
  :config
  (which-key-mode)
  (setq which-key-idle-dely 0.5)
  (which-key-setup-minibuffer))
#+END_SRC

*** Ivy and Related Packages
#+BEGIN_SRC elisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :diminish ivy-mode
  :diminish counsel-mode
  :bind (("C-s" . swiper)
         ("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :init
  (ivy-mode 1)
  (counsel-mode 1)
  :config
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t))

(use-package ivy-prescient
  :after counsel
  :init
  (ivy-prescient-mode)
  (prescient-persist-mode))

(use-package prescient
  :defer 0
  :diminish
  :config)
#+END_SRC

*** Helpful
#+BEGIN_SRC elisp
(use-package helpful  
  :defer t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+END_SRC

