emacs_config.org
*** Text Scale Hydra
#+BEGIN_SRC elisp
(defhydra hydra-text-scale (:timeout 4) 
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))
#+END_SRC


* LSP Configuration

** Core LSP Configuration
#+begin_src elisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook 
  (lsp-mode . lsp-enable-which-key-integration)
  :custom
  (lsp-diagnostics-provider :capf)
  (lsp-headerline-breadcrumb-enable t)
  (lsp-headerline-breadcrumb-segments '(project file symbols))
  (lsp-lens-enable nil)
  (lsp-disabled-clients '((python-mode . pyls)))
  :init
  (setq lsp-keymap-prefix "C-c l")) ;; Or 'C-l', 's-l'
#+end_src

** LSP Ivy Integration
#+begin_src elisp
(use-package lsp-ivy
  :after lsp-mode)
#+end_src

** LSP UI Configuration
#+begin_src elisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :after lsp-mode
  :custom
  (lsp-ui-doc-show-with-cursor nil)
  :config
  (setq lsp-ui-doc-position 'bottom))
#+end_src

** Company Box for LSP
#+begin_src elisp
(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** LSP Treemacs Integration
#+begin_src elisp
(use-package lsp-treemacs
  :after (lsp-mode treemacs))
#+end_src

** LSP Pyright for Python
#+begin_src elisp
(use-package lsp-pyright
  :hook
  (python-mode . (lambda ()
                   (require 'lsp-pyright)
                   (lsp-deferred))))
#+end_src


* Project Management and Development Tools

** Code Formatting
#+begin_src elisp
(use-package blacken
  :defer t
  :init
  (setq-default blacken-fast-unsafe nil))
  ;; (setq-default blacken-line-length 80)
#+end_src

** Autocompletion with Company
#+begin_src elisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package company-prescient
  :after company
  :config
  (company-prescient-mode 1)
  (prescient-persist-mode))

(global-company-mode)
#+end_src

** Project Navigation with Projectile
#+begin_src elisp
(use-package projectile  
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Dropbox/Projects/Code")
    (setq projectile-project-search-path '("~/Dropbox/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile  
  :config (counsel-projectile-mode))
#+end_src

** Git Integration with Magit
#+begin_src elisp
(use-package magit 
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package forge)
#+end_src

** Text Editing Enhancements
#+begin_src elisp
(add-hook 'text-mode-hook 'visual-line-mode) ;; Sensible line breaking
(delete-selection-mode t) ;; Overwrite selected text
(setq scroll-error-top-bottom t)
#+end_src

** Spell Checking with Flyspell
#+begin_src elisp
(use-package flyspell
   :config
   ;; (setq ispell-program-name "hunspell"
   ;;       ispell-default-dictionary "en_AU")
   :hook (text-mode . flyspell-mode)
   :bind (("M-<f7>" . flyspell-buffer))
          ("<f7>" . flyspell-word)
          ("C-;" . flyspell-auto-correct-previous-word))
#+end_src

** Quick Note Taking with Deft
#+begin_src elisp
(use-package deft
  :config
  (setq deft-directory org-directory
        deft-recursive t
        deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"
        deft-use-filename-as-title t)
  :bind
  ("C-c n d" . deft))
#+end_src

** Eldoc Configuration
#+begin_src elisp
(use-package eldoc
  :diminish eldoc-mode)
#+end_src

** Syntax Checking with Flycheck
#+begin_src elisp
(use-package flycheck
  :diminish flycheck-mode
  :init
  (setq flycheck-check-syntax-automatically '(save new-line)
        flycheck-idle-change-delay 5.0
        flycheck-display-errors-delay 0.9
        flycheck-highlighting-mode 'symbols
        flycheck-indication-mode 'left-fringe
        flycheck-standard-error-navigation t
        flycheck-deferred-syntax-check nil))
#+end_src

** Snippets with Yasnippet
#+begin_src elisp
(use-package yasnippet
  :ensure t
  :diminish
  :config
  (use-package yasnippet-snippets)
  (yas-reload-all)
  (yas-global-mode 1))

(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)
(define-key yas-minor-mode-map (kbd "<C-tab>") 'yas-expand)
#+end_src


* Programming Languages
**  PYTHON

#+BEGIN_SRC   elisp   
(use-package python-mode
  :hook
  (python-mode . flycheck-mode)
  (python-mode . company-mode)
  (python-mode . blacken-mode)
  (python-mode . yas-minor-mode)
  :custom
  (python-shell-interpreter "python3") 
  :config
  )


(use-package pyvenv
  :defer t
  :hook (pyvenv-mode . python-mode)
  :config
  (pyvenv-mode 1))
  


#+END_SRC   

**  HASKELL
#+BEGIN_SRC   haskell   
(use-package haskell-mode
  :defer t)
(require 'haskell-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
(setq-default indent-tabs-mode nil)
#+END_SRC   

** Yaml
#+BEGIN_SRC   elisp   

  (use-package  yaml-mode
    :ensure t)


#+END_SRC   

** C/C++


* Org Mode

#+begin_src elisp
(setq image-dired-external-viewer "/usr/bin/gimp")

(use-package org)

(setq org-startup-indented t
      org-pretty-entities t
      org-hide-emphasis-markers t
      org-startup-with-inline-images t
      org-image-actual-width '(200))

(use-package org-appear
  :hook (org-mode . org-appear-mode))

(use-package deft
  :defer t
  :config
  (setq deft-directory org-directory
        deft-recursive t
        deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"
        deft-use-filename-as-title t))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (python . t) 
   (shell . t) 
   (haskell . t) 
   (latex . t) 
   (matlab . t)
   (sql . t)
   (emacs-lisp . t)))

(setq org-babel-python-command "python3")


(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (efs/org-font-setup))


(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "●" "○" "●" "○" "●" "○" "●")))


(setq sql-postgres-login-params
      '((user :default "postgres")
        (database :default "analysis")
        (server :default "localhost")
        (port :default 5432)))
#+end_src 


* LaTeX Configurations

** PDF Tools
#+BEGIN_SRC elisp
(use-package pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-page))
#+END_SRC

