emacs_config.org
** AUCTeX
#+BEGIN_SRC elisp
(use-package auctex
  :ensure t
  :defer t
  :hook (LaTeX-mode . (lambda ()
                        (push (list 'output-pdf "Zathura")
                              TeX-view-program-selection)))
        (LaTeX-mode . turn-on-prettify-symbols-mode))

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-source-correlate-start-server t)

(add-hook 'TeX-after-compilation-finished-functions
          #'TeX-revert-document-buffer)

(put 'LaTeX-narrow-to-environment 'disabled nil)
#+END_SRC

** CDLaTeX
#+BEGIN_SRC elisp
(use-package cdlatex
  :hook (LaTeX-mode . cdlatex-mode)
  :config
  (cdlatex-mode 1))
#+END_SRC

** Company Math
#+BEGIN_SRC elisp
(use-package company-math)
  ;; :hook (LaTeX-mode . company-math)
#+END_SRC

** LaTeX Auto-Activation Snippets (laas)
#+BEGIN_SRC elisp
(use-package laas
  :hook (LaTeX-mode . lass-mode))
#+END_SRC

** TeX-fold-mode and Other Hooks
#+BEGIN_SRC elisp
(add-hook 'TeX-mode-hook #'TeX-fold-mode)
(add-hook 'TeX-language-dk-hook
          (lambda () (ispell-change-dictionary "english")))

;; Enable parse on load and save.
(setq TeX-parse-self t)
(setq TeX-auto-save t)

(add-hook 'TeX-mode-hook 'flyspell-mode)
(add-hook 'TeX-mode-hook
          (lambda () (TeX-fold-mode 1)))
(add-hook 'TeX-mode-hook 'LaTeX-math-mode)
(add-hook 'TeX-mode-hook 'turn-on-reftex)
#+END_SRC


* Extensions and Modes

** Minions
#+BEGIN_SRC elisp
(use-package minions
  :custom
  (minions-mode 1))
#+END_SRC

** CSV Mode
#+BEGIN_SRC elisp
(use-package csv-mode
  :mode "\\.csv\\'"
  :preface
  (defun csv-remove-commas ()
    (interactive)
    (goto-char (point-min))
    (while (re-search-forward "\"\\([^\"]+\\)\"" nil t)
      (replace-match (replace-regexp-in-string "," "" (match-string 1))))))
#+END_SRC

** Markdown Mode
#+BEGIN_SRC elisp
(use-package markdown-mode
  :mode (("\\`README\\.md\\'" . gfm-mode)
         ("\\.md\\'"          . markdown-mode)
         ("\\.markdown\\'"    . markdown-mode))
  :custom
  (markdown-command "pandoc -f markdown_github+smart")
  (markdown-command-needs-filename t)
  (markdown-enable-math t)
  (markdown-open-command "marked")
  :custom-face
  (markdown-header-face-1 ((t (:inherit markdown-header-face :height 2.0))))
  (markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.6))))
  (markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.4))))
  (markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.2))))
  :init
  (setq markdown-command "multimarkdown"))
#+END_SRC

** Markdown Preview Mode
#+BEGIN_SRC elisp
(use-package markdown-preview-mode
  :after markdown-mode
  :config
  (setq markdown-preview-stylesheets
        (list (concat "https://github.com/dmarcotte/github-markdown-preview/"
                      "blob/master/data/css/github.css"))))
#+END_SRC

** Elisp Lint
#+BEGIN_SRC elisp
(use-package elisp-lint)
#+END_SRC

** Focus
#+BEGIN_SRC elisp
(use-package focus)
#+END_SRC

** Aggressive Indent
#+BEGIN_SRC elisp
(use-package aggressive-indent
  :diminish
  :hook (emacs-lisp-mode . aggressive-indent-mode))
#+END_SRC

** Emojify
#+BEGIN_SRC elisp
(use-package emojify
  :after erc
  :config
  (global-emojify-mode))
#+END_SRC


* Keyboard Bindings

** Leader Key Bindings
#+BEGIN_SRC elisp
(rune/leader-keys
  "sq" '(sql-postgres :which-key "sql-postgres")
  "ww" '(evil-window-next :which-key "evil-window-next")
  "mm" '(markdown-mode :which-key "markdown-mode")
  "mv" '(markdown-view-mode :which-key "markdown-view-mode")
  "ts" '(hydra-text-scale/body :which-key "scale text")
  "cc" '(TeX-command-run-all :which-key "Tex-command-run-all")
  "cb" '(kill-this-buffer :which-key "kill-this-buffer")
  "cn" '(global-display-line-numbers-mode :which-key "global-display-number-mode")
  "tm" '(vterm :which-key "vterm")
  "ss" '(sly :which-key "sly")
  "cl" '(global-display-fill-column-indicator-mode :which-key "global-display-fill-column-indicator-mode")
  "bm" '(blacken-mode :which-key "blacken-mode")
  "tc" '(TeX-clean :which-key "TeX-clean")
  "lb" '(list-buffers :which-key "list-buffers")
  "tp" '(transparency :which-key "transparency")
  "bf" '(eval-buffer :which-key "eval-buffer")
)
#+END_SRC

** Global Key Bindings
#+BEGIN_SRC elisp
(global-set-key (kbd "C-c t") 'toggle-transparency)
(global-set-key (kbd "<f1>") (lambda() (interactive) (find-file "~/Dropbox/mat265/")))
(global-set-key (kbd "<f2>") (lambda() (interactive) (find-file "~/Dropbox/GTD.org")))
(global-set-key (kbd "<f3>") (lambda() (interactive) (find-file "~/Dropbox/config/")))
(global-set-key (kbd "<f4>") (lambda() (interactive) (find-file "~/Dropbox/research/clustering_particles/density_estimation")))
(global-set-key (kbd "<f5>") (lambda() (interactive) (find-file "~/Dropbox/projects/")))
#+END_SRC


** 

#+begin_src elisp
  ;; (load-user-file "./config/terminal.el")
  ;; (load-user-file "./config/project.el")
  ;; (load-user-file "./config/lsp.el")
  ;; (load-user-file "./config/orgmode.el")
  ;; (load-user-file "./config/latex.el")
  ;; (load-user-file "./config/kbd.el")

 #+end_src 


* Terminal Configuration

** Term Configuration
#+BEGIN_SRC elisp
(use-package term
  :defer t
  :config
  (setq explicit-shell-file-name "bash") 
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
#+END_SRC

** VTerm Configuration
#+BEGIN_SRC elisp
(use-package vterm
  :defer t
  :config
  (setq explicit-shell-file-name "bash") 
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
#+END_SRC

** Terminal Modes Line Numbers Configuration
#+BEGIN_SRC elisp
(dolist (mode '(term-mode-hook
                shell-mode-hook
                eshell-mode-hook
                vterm-mode-hook
                treemacs-mode-hook))
  (add-hook mode (lambda ()
                   (display-line-numbers-mode -1))))
#+END_SRC


